tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
cask 'xquartz'

brew 'coreutils'

# terminal tools
brew 'zsh'
brew 'zsh-completions'
brew 'ack'
brew 'the_silver_searcher'
brew 'colordiff'

# Vim
brew 'vim', args: ['with-override-system-vi']

# tools for Vim
brew 'cmake'
brew 'ctags'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Python
brew 'python'

# Go
brew 'go'
brew 'dep'

# JS
brew 'node'

# Database
brew 'mysql', restart_service: true
brew 'sqlite'
brew 'mongodb'

brew 'autoconf'
brew 'cscope'
brew 'libpng', args: ['universal']
brew 'freetype', args: ['universal']
brew 'fontconfig', args: ['universal']
brew 'jpeg', args: ['universal']
brew 'libtiff', args: ['universal']
brew 'webp', args: ['universal']
brew 'gd', args: ['universal']
brew 'gdbm'
brew 'gmp'
brew 'libtasn1', args: ['universal']
brew 'libunistring'
brew 'nettle'
brew 'libffi'
brew 'p11-kit'
brew 'gnutls'
brew 'jasper', args: ['universal']
brew 'libtool', args: ['universal']
brew 'libusb', args: ['universal']
brew 'libusb-compat', args: ['universal']
brew 'libgphoto2', args: ['universal']
brew 'libicns', args: ['universal']
brew 'little-cms2', args: ['universal']
brew 'makedepend'
brew 'openssl', args: ['universal']
brew 'readline'
brew 'net-snmp'
brew 'p7zip'
brew 'pcre'
brew 'pkg-config'
brew 'qt@5.5'
brew 'sane-backends', args: ['universal']
brew 'xz'
brew 'wget'
brew 'wine'

cask 'iterm2'
cask 'macdown'
